# MaximumRowHeight Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
TableView..::..MaximumRowHeight Property
TableView Class See Also
---
Gets the maximum row height
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public int MaximumRowHeight { get; }
```

Visual Basic
---
```text
Public ReadOnly Property MaximumRowHeight As Integer
	Get
```

Visual C++
---
```text
public:
property int MaximumRowHeight {
	int get ();
}
```

# See Also
TableView Class
Autodesk.Revit.DB Namespace